InformationRegisters/СведеньяМатериалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведеньяМатериалы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материал</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РегистрМатериалыЦена/Ext/Module.bsl
Функция ПолучениеЦены(Материал) Экспорт
	Данные = РегистрыСведений.СведеньяМатериалы.СоздатьНаборЗаписей();
	Данные.Прочитать();
	Для каждого Запись из Данные Цикл
		Если Запись.Материал = Материал Тогда
			Возврат Запись.Цена;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции
